[NeutralizeFieldCommander_var01 X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="找到外星人指挥官"
ObjectiveTextPools[1]="杀死外星人指挥官"
ObjectiveTextPools[2]="消灭所有目标敌人"
ObjectiveTextPools[3]="撤出所有XCOM特工"

[NeutralizeFieldCommander_var01 X2MissionTemplate]
DisplayName="消灭外星人指挥官"
Briefing="消灭外星人指挥官"
PostMissionType="消灭外星人指挥官"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="找到并消灭外星人指挥官"
ObjectiveTextPools[1]="别让外星人指挥官逃走"
+PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_A"
+PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_B"
+PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_C"

[GOp_FieldCommander_var01 X2MissionFlavorTextTemplate]
+FlavorText="缺少背景叙述"
+CouncilSpokesmanSuccessText="干得漂亮，指挥官。成功消灭<XGParam:StrValue0/!WorldRegionName/>的变种人原型对敌人来说无疑是一个挫折。"
+CouncilSpokesmanFailureText="不幸的是<XGParam:StrValue0/!WorldRegionName/>内那个变种人原型逃脱我们刺杀的消息已经传了出去。我们不能再浪费那样的好机会了。"  

[ABASectoidGeneral X2CharacterTemplate]
+strCharacterName="外星人指挥官"
+strAcquiredText="这就是我们来这里的目的。消灭极端分子。 

[ABAViperGeneral X2CharacterTemplate]
+strCharacterName="外星人指挥官"
+strAcquiredText="这就是我们来这里的目的。消灭极端分子。" 

[ABAMutonGeneral X2CharacterTemplate]
+strCharacterName="外星人指挥官"
+strAcquiredText="这就是我们来这里的目的。消灭极端分子。" 

[ABAArchonGeneral X2CharacterTemplate]
+strCharacterName="外星人指挥官"
+strAcquiredText="这就是我们来这里的目的。消灭极端分子。" 

[ABAAvatarGeneral X2CharacterTemplate]
+strCharacterName="外星人指挥官"
+strAcquiredText="这就是我们来这里的目的。消灭极端分子。" 
